{"sites":[
  {"name":"Pencil", "url":"http://students.washington.edu/njfoster/Info343/a2-html-css-natejfoster/", "img":"./imgs/pencil.png", "desc":"For this project, I was given high fidelity prototype of a website. My task was to implement the prototype using HTML and CSS. This project offered an excellent look into the industry, and the process of building a website from a design scheme. Defining the CSS to mimic the design was highly time consuming and tedious, however, the satisfaction of finishing was well worth it.", "subtitle":"Info343 Assignment 2"},
  {"name":"MassShootings", "url":"http://students.washington.edu/njfoster/Info343/a3-mapping-natejfoster/", "img":"./imgs/mapping.png", "desc":"This project was my first experience working with JavaScript and real world data. I utilized PapaParse.js to read in data from a csv. Then using that data, I created a map using Leaflet.js. While building nifty webpages is cool, it is important to consider just how much impact I could have by presenting real world data in thought-provoking ways. This project takes a small glimpse at the true power of information at work.", "subtitle":"Info343 Assignment 3"},
  {"name":"Chirp", "url":"http://students.washington.edu/njfoster/Info343/a4-firebase-natejfoster/sign-in.html", "img":"./imgs/chirp.png", "desc":"Enter Firebase. Firebase is a mobile and web application platform provided by Google to assist developers. In this project, I used the database and authentication features of Firebase, and what better way to pratice using these tools than build Twitter from scratch...well the basic functionality that is. ", "subtitle":"Info343 Assignment 4"},
  {"name":"MoodMusic", "url":"http://students.washington.edu/njfoster/Info343/a5-spotify-natejfoster/main.html", "img":"./imgs/moodmusic.png", "desc":"\"The direction of the project is up to you...\" Well, that's helpful... For this project, the scope was limited by only my own creativity and current skill level. To complete the project, I leveraged React to generate page content dynamically. The main content of the app is collected using the Spotify API. This project was my first experience working with React as well as an API. Jokes aside from earlier, I thoroughly enjoyed being set loose with the skills I have developed thus far. ", "subtitle":"Info343 Assignment 5"}
]}
